notes/d-jupyter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-04-18 Sat 20:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DUBに対応したD言語のREPL/Jupyter</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeki Karita" />
<link rel="stylesheet" type="text/css" href="/css/org.css"/>
 <link href="/css/code.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">DUBに対応したD言語のREPL/Jupyter</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26720ed">1. 背景</a></li>
<li><a href="#orgf3886a8">2. dreplの仕組み</a></li>
<li><a href="#org55c921f">3. DUBのパッケージを使えるようにする</a>
<ul>
<li><a href="#orge634662">3.1. One-Definiton Rule (ODR) 違反</a></li>
</ul>
</li>
<li><a href="#org5a0e503">4. Jupyter対応</a>
<ul>
<li><a href="#org4cadf07">4.1. インストール方法</a></li>
<li><a href="#orgf0535e8">4.2. Python版っぽく動かす</a></li>
</ul>
</li>
<li><a href="#org6c42db0">5. 今後の方針</a></li>
</ul>
</div>
</div>
<div class="abstract">
<p>
昨日アップロード予定だったgrainの入門記事が未完成なので，こちらを先にアップロードしました．もう少し待っててください．
</p>

</div>

<div id="outline-container-org26720ed" class="outline-2">
<h2 id="org26720ed"><span class="section-number-2">1</span> 背景</h2>
<div class="outline-text-2" id="text-1">
<p>
D言語はリファレンス実装のDMDなどコンパイルがC++より大分速いので，前からREPL(read-eval-print loop)で対話的に書ける環境があれば良いなと思ってました．
</p>

<p>
<a href="https://github.com/dlang-community/drepl">https://github.com/dlang-community/drepl</a>
</p>

<p>
有名なツールだと上記のdreplという実装があり，かなり快適に使えるのですが2つ要望がありました．
</p>

<ul class="org-ul">
<li>DUBパッケージを使いたい</li>
<li>Jupyterで使いたい</li>
</ul>

<p>
DUBというのはPythonでいうpipみたいなやつで，サードパーティのライブラリを管理するパッケージマネージャです．つまりdreplはphobos標準ライブラリしか使えません．JupyterというのはPython/Julia/Rで有名なブラウザからREPLを使えて共有できる便利なツールです．本稿の内容はそれらの機能を雑に実装してみたという話です．まだ未完成なので更なる要望やPRなどお待ちしてます（そのために記事を書きました）．
</p>
</div>
</div>

<div id="outline-container-orgf3886a8" class="outline-2">
<h2 id="orgf3886a8"><span class="section-number-2">2</span> dreplの仕組み</h2>
<div class="outline-text-2" id="text-2">
<p>
drepl (src/console.d)(<a href="https://github.com/dlang-community/drepl/blob/v0.2.1/src/console.d">https://github.com/dlang-community/drepl/blob/v0.2.1/src/console.d</a>) は以下のような仕組みで成り立っています．
</p>

<ol class="org-ol">
<li>入力テキスト（コード）を適切に前処理</li>
<li>前処理後のコードをモジュールとして動的ライブラリにコンパイル，過去にコンパイルした動的ライブラリと共にリンク</li>
<li>ライブラリ内の一番新しいmain的な関数を実行</li>
<li>結果を表示する</li>
<li>1へループ</li>
</ol>

<p>
以上の処理は大まかに2つの構造体で実装しています．
</p>

<ol class="org-ol">
<li>Interpreter(<a href="https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/interpreter.d#L17">https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/interpreter.d#L17</a>): readとprintの部分を担当しています．ユーザの入力テキストを受けとり，宣言/式/文を判定してDMDEngineに渡し，InterpretResult型の実行結果を返します．</li>
<li>DMDEngine(<a href="https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L47">https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L47</a>) evalの部分を担当しています．以下の3つの仕事をします．
<ul class="org-ul">
<li>evalDecl/Expr/Stmt(<a href="https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L68">https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L68</a>): Interpreterから受け取った宣言/式/文をそれぞれモジュールとしてコンパイラに解釈できるよう前処理し，コンパイル・main的な関数を呼び出し，EngineResult型の結果を返す</li>
<li>compileModule(<a href="https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L194">https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L194</a>): 前処理したモジュールを，過去のモジュールをインクルード/リンクして動的ライブラリとしてコンパイル</li>
<li>loadFunc(<a href="https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L210">https://github.com/dlang-community/drepl/blob/v0.2.1/src/drepl/engines/dmd.d#L210</a>): REPLとして実行するコードを格納したmain的な関数を呼び出す</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-org55c921f" class="outline-2">
<h2 id="org55c921f"><span class="section-number-2">3</span> DUBのパッケージを使えるようにする</h2>
<div class="outline-text-2" id="text-3">
<p>
前節から，とりあえずDMDEngine.compileModule関数を拡張して，DUBを使って外部ライブラリを過去のモジュール同様にパスを通して，インクルード/リンクしてやれば良いということがわかります．残念ながらDMDEngineはクラスではなく構造体なので，継承とかはできず，コピペしました．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">struct</span> <span class="org-type">DUBEngine</span> {
    <span class="org-comment-delimiter">/// </span><span class="org-comment">&#20182;&#12398;&#37096;&#20998;&#12399;DMDEngine&#12398;&#12467;&#12500;&#12506;</span>
    <span class="org-keyword">this</span>(<span class="org-type">string</span>[] <span class="org-variable-name">packages</span>, <span class="org-type">CompilerOpt</span> <span class="org-variable-name">compiler</span>, <span class="org-type">string</span> <span class="org-variable-name">tmpDir</span>) {
        ...
        packages.each<span class="org-negation-char">!</span>(p =&gt; <span class="org-keyword">this</span>.registerPackage(p));
    }

    <span class="org-comment-delimiter">/// </span><span class="org-comment">REPL&#12434;&#12499;&#12523;&#12489;&#12377;&#12427; dub.json &#12363;&#12425; package &#12434;&#25277;&#20986;</span>
    <span class="org-type">void</span> <span class="org-function-name">registerPackage</span>(<span class="org-type">string</span> <span class="org-variable-name">_package</span>) {
        <span class="org-keyword">import</span> std.<span class="org-type">file</span> : exists;
        <span class="org-keyword">import</span> std.<span class="org-type">algorithm</span> : map;
        <span class="org-keyword">import</span> std.<span class="org-type">json</span> : parseJSON;
        <span class="org-keyword">import</span> std.<span class="org-type">range</span> : chain;
        <span class="org-keyword">import</span> std.<span class="org-type">process</span> : execute;

        <span class="org-keyword">auto</span> <span class="org-variable-name">dubDescribe</span> = execute([<span class="org-string">"dub"</span>, <span class="org-string">"describe"</span>, _package,
                <span class="org-string">"--compiler="</span> ~ _compiler.compiler]);
        <span class="org-keyword">if</span> (dubDescribe.status != 0) {
            <span class="org-keyword">throw</span> <span class="org-keyword">new</span> Exception(<span class="org-string">"failed: $ dub describe "</span> ~ _package ~ <span class="org-string">"\n"</span>
                    ~ dubDescribe.output ~ <span class="org-string">"\n\nsuggest: $ dub fetch "</span> ~ _package);
        }
        <span class="org-keyword">auto</span> <span class="org-variable-name">dubInfo</span> = parseJSON(dubDescribe.output);
        <span class="org-keyword">auto</span> <span class="org-variable-name">target</span> = dubInfo[<span class="org-string">"targets"</span>][0];
        <span class="org-keyword">assert</span>(<span class="org-type">target</span>[<span class="org-string">"rootPackage"</span>].<span class="org-variable-name">str</span> == _package);
        <span class="org-keyword">auto</span> <span class="org-variable-name">build</span> = target[<span class="org-string">"buildSettings"</span>];
        <span class="org-keyword">auto</span> <span class="org-function-name">read</span>(<span class="org-type">string</span> <span class="org-variable-name">key</span>) {
            <span class="org-keyword">return</span> build[key].array.map<span class="org-negation-char">!</span><span class="org-string">"a.str"</span>.array;
        }

        _dubFlags.insert(chain(read(<span class="org-string">"importPaths"</span>).map<span class="org-negation-char">!</span>(a =&gt; <span class="org-string">"-I"</span> ~ a),
                               read(<span class="org-string">"libs"</span>).map<span class="org-negation-char">!</span>(a =&gt; <span class="org-string">"-L-l"</span> ~ a),
                               read(<span class="org-string">"versions"</span>).map<span class="org-negation-char">!</span>(a =&gt; _compiler.ver ~ <span class="org-string">"="</span> ~ a),
                               read(<span class="org-string">"linkerFiles"</span>)));

        <span class="org-keyword">immutable</span> <span class="org-variable-name">targetFileName</span> = build[<span class="org-string">"targetPath"</span>].str ~ <span class="org-string">"/lib"</span> ~ build[<span class="org-string">"targetName"</span>]
            .str ~ <span class="org-string">".a"</span>;
        <span class="org-keyword">if</span> (targetFileName.exists) {
            _dubFlags.insert(targetFileName);
        }
    }

    <span class="org-type">string</span> <span class="org-function-name">compileModule</span>(<span class="org-type">string</span> <span class="org-variable-name">path</span>) {
        <span class="org-keyword">import</span> std.<span class="org-type">process</span> : execute;
        <span class="org-keyword">import</span> std.<span class="org-type">format</span> : format;
        <span class="org-keyword">import</span> std.<span class="org-type">file</span> : exists;
        <span class="org-keyword">import</span> std.<span class="org-type">regex</span> : ctRegex, replaceAll;
        <span class="org-keyword">import</span> std.<span class="org-type">range</span> : chain;

        logger.trace(<span class="org-string">"compile path: "</span>, path);
        <span class="org-comment-delimiter">// </span><span class="org-comment">DUB&#12398;&#12499;&#12523;&#12489;&#35373;&#23450;&#12434;&#36861;&#35352;&#12375;&#12390;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21205;&#30340;&#12521;&#12452;&#12502;&#12521;&#12522;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;</span>
        <span class="org-keyword">auto</span> <span class="org-variable-name">args</span> = chain(_compiler.cmd,
                          [<span class="org-string">"-I"</span> ~ _tmpDir, <span class="org-string">"-of"</span> ~ path ~ <span class="org-string">".so"</span>, <span class="org-string">"-shared"</span>, path, <span class="org-string">"-L-l:libphobos2.so"</span>],
                          _dubFlags[]).array;

        <span class="org-keyword">foreach</span> (i; 0 .. _id)
            args ~= <span class="org-string">"-L"</span> ~ _tmpDir ~ format(<span class="org-string">"/_mod%s.so"</span>, i);

        logger.trace(<span class="org-string">"compile with: "</span>, args);
        <span class="org-keyword">auto</span> <span class="org-variable-name">dmd</span> = execute(args);
        <span class="org-keyword">enum</span> <span class="org-type">cleanErr</span> = ctRegex<span class="org-negation-char">!</span>(<span class="org-string">`^.*Error: `</span>, <span class="org-string">"m"</span>);
        <span class="org-keyword">if</span> (dmd.status != 0)
            <span class="org-keyword">return</span> dmd.output.replaceAll(cleanErr, <span class="org-string">""</span>);
        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>exists(path ~ <span class="org-string">".so"</span>))
            <span class="org-keyword">return</span> path ~ <span class="org-string">".so not found"</span>;
        <span class="org-keyword">return</span> <span class="org-string">""</span>;
    }
}
</pre>
</div>

<p>
やってることは以下の2つです．注意点として，importされるライブラリは予めreplのビルド設定dub.json/.sdlのdependenciesに記載する必要があります．
</p>

<ol class="org-ol">
<li>初期化時にregisterPackagesメソッドが，REPLのビルド設定(`dub describe` が出力する json)をパースして使う package 情報を抜き出して，`_dubFlags`としてビルド設定を保存</li>
<li>compileModuleメソッドは `_dubFlags` を追加してモジュールをコンパイル</li>
</ol>

<p>
最終的には以下のモジュールにmain関数を定義してループを回しています．
</p>

<p>
<a href="https://github.com/ShigekiKarita/grain/blob/v0.0.10/example/repl.d">https://github.com/ShigekiKarita/grain/blob/v0.0.10/example/repl.d</a>
</p>
</div>

<div id="outline-container-orge634662" class="outline-3">
<h3 id="orge634662"><span class="section-number-3">3.1</span> One-Definiton Rule (ODR) 違反</h3>
<div class="outline-text-3" id="text-3-1">
<p>
C++から離れて久しくD言語ばかり書いていたのでODR違反という問題に全くおもいつかなかったのですが，drepl本家の作者と議論したところ浮上しました．
</p>

<p>
<a href="https://github.com/dlang-community/drepl/issues/4#issuecomment-414331125">https://github.com/dlang-community/drepl/issues/4#issuecomment-414331125</a>
</p>

<p>
&gt; You're appproach looks interesting, but it has a flaw. It statically links packages into every subsequent D module, i.e. you'll end up with dozens of copies of the package.
That will break the One Definition Rule.
You really need to compile packages as shared libraries to avoid this. Atm. dub's support to compile packages as shared libs is still not fully there, e.g. dependencies need to be shared libs as well to avoid ODR issues.
</p>

<p>
解決策は2つあってどちらもそこそこ面倒です．
</p>

<ul class="org-ul">
<li>MartinNowak氏の案: DUBのパッケージを全て動的ライブラリとして扱えば，main的な関数の実行時までリンクされないのでODRは発生しない．ただしDUBの動的ライブラリ生成が弱いので限界がある</li>
<li>私の案: DUBの個々のパッケージは静的ライブラリのまま，DUBパッケージのみを隔離して固めた `libdub_merged.so` のような動的ライブラリを作る．`libphobos.so` と同様にODR違反は発生しないが，サイズはでかいし，動的なリンクしたいパッケージ指定の実装が面倒になる．</li>
</ul>

<p>
今の雑実装ではREPLをビルドする`dub.json`の`dependencies`に書かれてないpackageはimportできないし，D言語の静的ライブラリでそこまで巨大になることもないので(`libphobos.a`でも65 MB)，私は後者で良いと思っています．普通PythonのREPLでも動的にパッケージのインストールなどは想定してないと思うので&#x2026;大抵は起動前にpip installしますよね
</p>

<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/3821916/how-to-merge-two-ar-static-libraries-into-one">https://stackoverflow.com/questions/3821916/how-to-merge-two-ar-static-libraries-into-one</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org5a0e503" class="outline-2">
<h2 id="org5a0e503"><span class="section-number-2">4</span> Jupyter対応</h2>
<div class="outline-text-2" id="text-4">
<p>
以前から筆者自身もコソコソとJupyterのドキュメントを読みながら，Jupyter用のサーバプログラムを書いていたのですが，先に凄いクオリティで作ってくれた人が居ました
</p>

<p>
<a href="https://github.com/kaleidicassociates/jupyterd">https://github.com/kaleidicassociates/jupyterd</a>
</p>

<p>
ここでは，Interpreterが改造されていて，zeromqなどを使ってjupyterのプロセスに対して，ユーザ入力や実行結果を通信しているようです．というわけで先程作ったDUB拡張のEngineをjupyterdのInterpreterで呼び出せば良いわけです．
</p>

<div class="org-src-container">
<pre class="src src-d"><span class="org-keyword">import</span> jupyterd.<span class="org-type">interpreter</span>;
<span class="org-keyword">final</span> <span class="org-keyword">class</span> <span class="org-type">DynamicDUBInterpreter</span> : <span class="org-type">Interpreter</span>
{
    <span class="org-type">LanguageInfo</span> <span class="org-variable-name">li</span> = LanguageInfo(<span class="org-string">"D"</span>, __VERSION__, <span class="org-string">".d"</span>, <span class="org-string">"text/plain"</span>);

    <span class="org-keyword">private</span> <span class="org-keyword">import</span> drepl.<span class="org-type">engines</span>;
    <span class="org-type">InterpreterResult</span> <span class="org-variable-name">last</span>; 
    <span class="org-keyword">typeof</span>(<span class="org-constant">drepl</span>.<span class="org-constant">engines</span>.Interpreter<span class="org-negation-char">!</span>DUBEngine) intp;

    <span class="org-keyword">this</span>(<span class="org-type">DUBEngine</span> <span class="org-variable-name">engine</span>)
    {
        <span class="org-keyword">import</span> std.<span class="org-type">algorithm</span> : move;
        intp = interpreter<span class="org-negation-char">!</span>DUBEngine(move(engine));
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#12371;&#12371;&#20197;&#22806; jupyterd.interpreter.DInterpreter&#12398;&#12467;&#12500;&#12506;</span>
    ...
}


<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">string</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">Interpreter</span> <span class="org-variable-name">i</span> = <span class="org-keyword">new</span> DynamicDUBInterpreter(
        DUBEngine(packages.split,
                  CompilerOpt(compiler, build, flags))
    );
    ...
}
</pre>
</div>

<p>
全体の実装(汚い)
<a href="https://github.com/ShigekiKarita/grain/blob/v0.0.10/example/grain_jupyterd.d">https://github.com/ShigekiKarita/grain/blob/v0.0.10/example/grain_jupyterd.d</a>
</p>
</div>

<div id="outline-container-org4cadf07" class="outline-3">
<h3 id="org4cadf07"><span class="section-number-3">4.1</span> インストール方法</h3>
<div class="outline-text-3" id="text-4-1">
<p>
jupyterとdubはお好きな方法でインストールしてください
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/ShigekiKarita/grain --recursive
<span class="org-builtin">cd</span> grain
jupyter kernelspec install ./example/jupyterd --user
dub build --config=jupyterd --compiler=dmd
<span class="org-builtin">export</span> <span class="org-variable-name">PATH</span>=<span class="org-sh-quoted-exec">`pwd`</span>:$<span class="org-variable-name">PATH</span>
jupyter notebook
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0535e8" class="outline-3">
<h3 id="orgf0535e8"><span class="section-number-3">4.2</span> Python版っぽく動かす</h3>
<div class="outline-text-3" id="text-4-2">
<p>
最終的に動くnotebookの例です．きちんと式と文が区別されて，最後の式のみが出力されることが確認できます．
<a href="https://github.com/ShigekiKarita/grain/blob/v0.0.10/tutorial.ipynb">https://github.com/ShigekiKarita/grain/blob/v0.0.10/tutorial.ipynb</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org6c42db0" class="outline-2">
<h2 id="org6c42db0"><span class="section-number-2">5</span> 今後の方針</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>grain のリポジトリから分離してリファクタリング</li>
<li>動的ライブラリを使ってODR問題を解決する</li>
<li>LDC/GDCなどDMD以外のコンパイラ対応</li>
<li>ggplot-dなどのグラフ描画や画像表示をサポートする</li>
<li>Google Colaboratoryで動かす</li>
</ul>

<p>
以上の機能を1年くらいで作っていこうと思います
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Shigeki Karita</p>
<p class="date">Created: 2020-04-18 Sat 20:09</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
